Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Instances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting the project team using the contact form.
it_it: Casi di comportamento offensivo, molesto o comunque inaccettabile possono essere segnalati contattando il team di progetto tramite il modulo di contatto.

source: Instant preview of the XML files (components, screens)
it_it: Anteprima istantanea dei file XML (componenti, screen)

source: Instantiation
it_it: Istanziazione

source: Instead declare the variable in ``lv_global_t`` structure in ``lv_global.h`` and mark the variable with :cpp:expr:`(LV_GLOBAL_DEFAULT()->variable)` when it's used.
it_it: Invece, dichiarare la variabile nella struttura ``lv_global_t`` in ``lv_global.h`` e contrassegnarla con :cpp:expr:`(LV_GLOBAL_DEFAULT()->variable)` quando viene utilizzata.

source: Instead of calling the register functions one by one, it's also possible to load many XML files and assets at once.
it_it: Invece di chiamare le funzioni di registrazione una alla volta, è anche possibile caricare più file XML e risorse contemporaneamente.

source: Instead of directly adding styles to the UI elements it's also possible to add them conditionally when a :ref:`Subject <observer_how_to_use>`\ 's value equals to a reference value.
it_it: Invece di aggiungere stili direttamente agli elementi dell'interfaccia utente, è anche possibile aggiungerli in modo condizionale quando il valore di un :ref:`Subject <observer_how_to_use>` è uguale a un valore di riferimento.

source: Instead of loading the whole image at once, BMP pixels are read on demand, so using BMP images requires very little RAM.
it_it: Invece di caricare l'intera immagine in una volta, i pixel BMP vengono letti su richiesta, quindi, l'utilizzo di immagini BMP richiede pochissima RAM.

source: Instead of producing a binary, Emscripten produces WebAssembly, which is supported across modern browsers.
it_it: Invece di produrre un binario, Emscripten produce WebAssembly, supportato dai browser moderni.

source: Instead of setting local style properties directly, it's also possible to bind style properties to :ref:`Subject <observer_how_to_use>` values:
it_it: Invece di impostare direttamente le proprietà di stile locali, è anche possibile associare le proprietà di stile ai valori :ref:`Subject <observer_how_to_use>`:

source: Instead of storing the JSON string, a hex array is stored for the following reasons:
it_it: Invece di memorizzare la stringa JSON, viene memorizzato un array esadecimale per i seguenti motivi:

source: Instead of the regular :cpp:func:`lv_obj_add_state` and :cpp:func:`lv_obj_remove_state` functions, use :cpp:expr:`lv_imagebutton_set_state(imagebutton, LV_IMAGEBUTTON_STATE_...)` to set the state of Image Buttons.
it_it: Invece delle normali funzioni :cpp:func:`lv_obj_add_state` e :cpp:func:`lv_obj_remove_state`, si usa :cpp:expr:`lv_imagebutton_set_state(imagebutton, LV_IMAGEBUTTON_STATE_...)` per impostare lo stato degli Image Button.

source: Instead you can pass the config defines using build options.
it_it: Invece, è possibile passare le definizioni di configurazione utilizzando le opzioni di compilazione.

source: Instead, for example, use the background color for pressed and checked states and indicate the focused state with a different border color.
it_it: In alternativa, ad esempio, utilizzare il colore di sfondo per gli stati pressed e checked e indicare lo stato focused con un colore del bordo diverso.

source: Instead, it implements the MIPI DCS command set used in many LCD controllers with an SPI or i8080 bus, and provides a common framework for chip-specific display controllers.
it_it: Invece, implementa il set di comandi MIPI DCS utilizzato in molti controller LCD con bus SPI o i8080 e fornisce un framework comune per i controller display specifici per chip.

source: Instead, it is allocated by :ref:`Draw Units` when the first :ref:`Draw Task <draw tasks>` is dispatched.
it_it: Al contrario, viene allocato da :ref:`Draw Units` quando viene eseguito il primo :ref:`Task di Disegno <draw tasks>`.

source: Instead, the MicroPython glue code uses ``user_data`` to automatically keep track of the MicroPython callable object.
it_it: Invece, il codice "collante" di MicroPython usa ``user_data`` per tenere traccia automaticamente dell'oggetto richiamabile di MicroPython.

source: Instead, the library will close one of the cached images to free space.
it_it: Al contrario, la libreria chiuderà una delle immagini memorizzate nella cache per liberare spazio.

source: Instead, there are optional "headers" that can be attached to the calendar.
it_it: Al suo posto, sono disponibili delle "intestazioni" opzionali che possono essere allegate al calendario.

source: Instead, widgets are marked as "dirty." LVGL recalculates dirty widgets’ positions, sizes, and layouts just before redrawing the screen.
it_it: I widget vengono invece contrassegnati come "sporchi". LVGL ricalcola le posizioni, le dimensioni e i layout dei widget "sporchi" appena prima di ridisegnare lo schermo.

source: Instead, you can load an example by calling an ``lv_example_...`` function.
it_it: Invece, si può caricare un esempio chiamando la funzione ``lv_example_...``.

source: Instead, you must modify the ``platform.txt`` file for the specific board core you are using.
it_it: È invece necessario modificare il file ``platform.txt`` per il core specifico della scheda che si sta utilizzando.

source: Insufficient memory allocation will result in Out Of Memory (OOM) errors.
it_it: Un'allocazione di memoria insufficiente causerà errori di "Out Of Memory" (OOM).

source: Integer
it_it: Intero

source: Integer number in the range of roughly -2B to 2B by default.
it_it: Numero intero compreso tra circa -2B e 2B per default.

source: Integrate LVGL to your project using cmake
it_it: Integrare LVGL nel progetto usando cmake

source: Integrating LVGL
it_it: Integrazione di LVGL

source: Integration
it_it: Integrazione

source: Integration with existing applications: Embed LVGL UI elements into games, visualization tools, or other OpenGL applications.
it_it: Integrazione con applicazioni esistenti: Integra elementi dell'interfaccia utente LVGL in giochi, strumenti di visualizzazione o altre applicazioni OpenGL.

source: Intended for development and CI.
it_it: Destinato allo sviluppo e alla CI.

source: Intensity of recoloring (0 means no recoloring, 255 means full cover).
it_it: Intensità della ricolorazione (0 significa nessuna ricolorazione, 255 significa copertura completa).

source: Interacting to the DMA2D
it_it: Interazione col DMA2D

source: Interactive
it_it: Interattivo

source: Interactive Behavior
it_it: Comportamento Interattivo

source: Interactive area
it_it: Area interattiva

source: Interactive widgets (such as Buttons, Checkboxes, Sliders, etc.) can be automatically added to a default group.
it_it: I widget interattivi (come Pulsanti, Checkbox, Slider, ecc.) possono essere aggiunti automaticamente a un gruppo di default.

source: Interface: VGA
it_it: Interfaccia: VGA

source: Intermediate files are normally prepared in ./docs/intermediate/ and the final documentation will normally appear in ./docs/build/html/.
it_it: I file intermedi vengono normalmente preparati in ./docs/intermediate/ e la documentazione finale apparirà in ./docs/build/html/.

source: Intermediate values like LV_OPA_10, LV_OPA_20, etc result in semi-transparency.
it_it: Valori intermedi come LV_OPA_10, LV_OPA_20, ecc. generano una semi-trasparenza.

source: Internal Links
it_it: Link Interni

source: Internal Subsystems
it_it: Sottosistemi Interni

source: Internal field to store information about the palette or color of A8 images.
it_it: Campo interno per memorizzare informazioni sulla tavolozza o sul colore delle immagini A8.

source: Internal padding
it_it: Spaziatura interna

source: Internally, LVGL rounds the redrawn areas to byte boundaries.
it_it: Internamente, LVGL arrotonda le aree ridisegnate ai limiti dei byte.

source: Internally, a framebuffer will be allocated for this size, and ``XRGB8888`` color format will be set.
it_it: Internamente, verrà allocato un framebuffer per questa dimensione e verrà impostato il formato colore ``XRGB8888``.

source: Internally, these are implemented as special event callbacks.
it_it: Internamente, queste sono implementate come callback di eventi speciali.

source: Interop with LTDC and NeoChrom
it_it: Interoperabilità con LTDC e NeoChrom

source: Interop with the DMA2D and NeoChrom Draw Units
it_it: Interoperabilità con le unità di disegno DMA2D e NeoChrom

source: Interop with the LTDC driver and the DMA2D Draw Unit
it_it: Interoperabilità con il driver LTDC e la "Draw Unit" DMA2D

source: Invalidating Cache Entries
it_it: Invalidazione delle Voci della Cache

source: Invert y
it_it: Inversione della y

source: Is it possible to happen of an application to start crashing because the user enabled `CONFIG_LV_USE_PPA` option.
it_it: È possibile che un'applicazione inizi a bloccarsi perché l'utente ha abilitato l'opzione `CONFIG_LV_USE_PPA`.

source: Is it suggested to use PPA with the double buffer support of the ESP LVGL Port since it will not offer performance increase when using it in partial mode due to DMA2D memory bandwith.
it_it: Si consiglia di utilizzare PPA con il supporto a doppio buffer della porta ESP LVGL, poiché non offrirà un aumento delle prestazioni quando viene utilizzata in modalità parziale a causa della larghezza di banda di memoria DMA2D.

source: Is my MCU/hardware supported?
it_it: Questo MCU/hardware è supportato?

source: Is my display supported?
it_it: Questo display è supportato?

source: Isolating hardware-specific configurations allows you to share other metadata by using a different layer where that metadata might be common across several pieces of hardware.
it_it: Isolare le configurazioni specifiche dell'hardware consente di condividere altri metadati utilizzando un layer diverso, in cui tali metadati potrebbero essere comuni a diversi componenti hardware.

source: It allows for flexible text placement and styling, making it suitable for applications where text needs to follow a curved path, such as in gauges, dials, or custom interfaces.
it_it: Consente un posizionamento e uno stile flessibili del testo, rendendolo adatto ad applicazioni in cui il testo deve seguire un percorso curvilineo, come in indicatori, quadranti o interfacce personalizzate.

source: It allows to use +98% of all LVGL features.
it_it: Consente di utilizzare oltre il 98% di tutte le funzionalità di LVGL.

source: It allows you to efficiently and conveniently create, open and rename files and manage your project.
it_it: Consente di creare, aprire e rinominare file e gestire il progetto in modo efficiente e pratico.

source: It allows you to specify what object it applies to (the "variable"), which is available in the callback functions that are called as the Animation is playing through.
it_it: Consente di specificare a quale oggetto si applica (la "variabile"), che è disponibile nelle funzioni di callback che vengono chiamate durante la riproduzione dell'animazione.

source: It also introduced the Berry scripting language, a small-footprint language similar to Python and fully integrated in Tasmota.
it_it: Ha inoltre introdotto il linguaggio di scripting Berry, un linguaggio compatto simile a Python e completamente integrato in Tasmota.

source: It also offers the possibility to configure the build with different options, to enable or disable components, or to integrate custom scripts executions during the configuration/build phase.
it_it: Offre inoltre la possibilità di configurare la build con diverse opzioni, di abilitare o disabilitare componenti o di integrare l'esecuzione di script personalizzati durante la fase di configurazione/build.

source: It also possible to create new layers in these events, but the previous layer is also required since it will be the parent layer in :cpp:func:`lv_draw_layer`.
it_it: È anche possibile creare nuovi layer in questi eventi, ma è necessario anche quello precedente poiché sarà il layer padre in :cpp:func:`lv_draw_layer`.

source: It also requires the base address of the peripheral and configuration structure already set.
it_it: Richiede inoltre che l'indirizzo base della periferica e la struttura di configurazione siano già impostati.

source: It also supports plural forms.
it_it: Supporta anche le forme plurali.

source: It also works in a responsive way, meaning the Widget's size will be updated automatically as the parent’s size changes.
it_it: Funziona anche in modo responsive, il che significa che le dimensioni del widget verranno aggiornate automaticamente al variare delle dimensioni del genitore.

source: It can arrange items (child Widgets) into a 2D "table" that has rows and columns (tracks).
it_it: Può disporre gli elementi (Widget figlio) in una "tabella" 2D con righe e colonne (track).

source: It can arrange items (child Widgets) into rows or columns (tracks), handle wrapping, adjust the spacing between items and tracks, handle *grow* to make item(s) fill remaining space with respect to min/max width and height.
it_it: Si possono disporre gli elementi (Widget figli) in righe o colonne (track), gestire il wrapping, regolare la spaziatura tra elementi e track, gestire l'aumento di dimensione per far sì che gli elementi riempiano lo spazio rimanente rispetto alla larghezza e all'altezza minime/massime.

source: It can be a constant string like ``static const char * years = "2023\n2022\n2021\n2020\n2019";``, or can be generated dynamically into a buffer as well.
it_it: Può essere una stringa costante come ``static const char * years = "2023\n2022\n2021\n2020\n2019";``, oppure può essere generato dinamicamente in un buffer.

source: It can be a good idea to style it to be visible only in :cpp:enumerator:`LV_STATE_FOCUSED` state.
it_it: Può essere una buona idea impostarne lo stile in modo che sia visibile solo nello stato :cpp:enumerator:`LV_STATE_FOCUSED`.

source: It can be called multiple times with different ranges.
it_it: Può essere chiamato più volte con intervalli diversi.

source: It can be called multiple times with different strings.
it_it: Può essere chiamato più volte con stringhe diverse.

source: It can be done by declaring 2 arrays and the track sizes in them.
it_it: Questo può essere fatto dichiarando 2 array e le dimensioni delle track in essi contenute.

source: It can be downloaded `here <https://www.renesas.com/us/en/software-tool/e-studio>`__.
it_it: Può essere scaricato `qui <https://www.renesas.com/us/en/software-tool/e-studio>`__.

source: It can be found at `https://github.com/lvgl/lv_port_pc_eclipse <https://github.com/lvgl/lv_port_pc_eclipse>`__.
it_it: È disponibile all'indirizzo `https://github.com/lvgl/lv_port_pc_eclipse <https://github.com/lvgl/lv_port_pc_eclipse>`__.

source: It can be negative.
it_it: Può essere negativa.

source: It can be one of:
it_it: Può essere uno dei seguenti:

source: It can be overridden by ``<globals name="my_lib">``.
it_it: Può essere sovrascritto da ``<globals name="my_lib">``.

source: It can be ported to any other platform supported by MicroPython.
it_it: Può essere portato su qualsiasi altra piattaforma supportata da MicroPython.

source: It can be turned on by configuring :c:macro:`LV_USE_OBJ_PROPERTY` to ``1`` in ``lv_conf.h``.
it_it: Può essere attivata configurando :c:macro:`LV_USE_OBJ_PROPERTY` a ``1`` in ``lv_conf.h``.

source: It can be used like **Wayland**, **XCB**, **SDL** or **Qt** or it can be used for more embedded applications.
it_it: Può essere utilizzato come **Wayland**, **XCB**, **SDL** o **Qt** oppure per applicazioni più embedded.

source: It can be used to reduce binary image size.
it_it: Può essere utilizzato per ridurre le dimensioni delle immagini binarie.

source: It can blend foregrounds together with backgrounds controlled by a constant alpha value or from a pixel alpha channel.
it_it: Può eseguire il "blend" dei primi piani con i background controllati da un valore alfa costante o da un canale pixel alfa.

source: It can configure your project, build, flash, and debug.
it_it: Può configurare il progetto, compilarlo, flasharlo e debuggarlo.

source: It can even be a timestamp or other data current at the time the Widget was created.
it_it: Può anche essere un timestamp o altri dati correnti al momento della creazione del Widget.

source: It can handle various bit-per-pixel settings (1, 2, 3, 4, 8) in bitmaps, kerning, having only selected character ranges from multiple fonts, compressing bitmaps, and several others.
it_it: Può gestire diverse impostazioni di bit per pixel (1, 2, 3, 4, 8) nelle bitmap, la crenatura, la selezione di intervalli di caratteri da più font, la compressione delle bitmap e molte altre.

source: It can perform display data RAM read-/write-operation with no external clock to minimize power consumption.
it_it: Può eseguire operazioni di lettura/scrittura della RAM dei dati del display senza clock esterno, riducendo al minimo il consumo energetico.

source: It can perform display data RAM read/write operation with no external operation clock to minimize power consumption.
it_it: Può eseguire operazioni di lettura/scrittura dei dati di visualizzazione nella RAM senza bisogno di un clock esterno, riducendo al minimo il consumo energetico.

source: It can provide good dynamic scalability for the host system.
it_it: Può fornire una buona scalabilità dinamica per il sistema host.

source: It can scale/resize, but performance will be best when the base lottie size is as intended.
it_it: È possibile scalare/ridimensionare, ma le prestazioni saranno migliori quando le dimensioni di base del lottie sono quelle desiderate.

source: It cannot generate shadows for arbitrary shapes, text, or images.
it_it: Non può generare ombre per forme, testo o immagini arbitrarie.

source: It cannot use pointers as the event can reference UI elements that will be created only later in the ``<view>``.
it_it: Non può utilizzare puntatori poiché l'evento può fare riferimento a elementi dell'interfaccia utente che verranno creati solo in seguito nella ``<view>``.

source: It comes fully configured with LVGL (and with PXP/VGLite/G2D support if the modules are present), no additional integration work is required.
it_it: È completamente configurato con LVGL (e con supporto PXP/VGLite/G2D se i moduli sono presenti), non è richiesto alcun ulteriore lavoro di integrazione.

source: It consists of 396 source line and 162 gate line driving circuits.
it_it: È costituito da 396 circuiti di pilotaggio per linee "source" e 162 per linee di gate.

source: It consists of 4 main tools:
it_it: Si compone di 4 strumenti principali:

source: It consists of 720 source line and 320 gate line driving circuits.
it_it: È costituito da 720 circuiti di pilotaggio per linee "source" e 320 per linee di gate.

source: It consists of 960 source lines and 480 gate lines driving circuits.
it_it: È costituito da 960 linee "source" e 480 linee di gate per il pilotaggio dei circuiti.

source: It contains 252-channel source driver, a 24-channel GIP driver which used for dual-gate control, 161,784-byte GRAM for graphic display data, internal precise power supply circuit which supports full color, 8-color display mode and sleep mode NV3007 supports 3-/4-line serial peripheral interface (SPI) ， quad serial peripheral interface (QSPI).
it_it: Contiene un sorgente di driver a 252 canali, un driver GIP a 24 canali utilizzato per il controllo a doppio gate, 161.784 byte di GRAM per i dati di visualizzazione grafica, un circuito di alimentazione interno di precisione che supporta la modalità di visualizzazione a colori, a 8 colori e in modalità sleep. NV3007 supporta l'interfaccia periferica seriale (SPI) a 3/4 linee e l'interfaccia periferica seriale quad (QSPI).

source: It contains several directories but to use LVGL you only need the ``.c`` and ``.h`` files under the ``src`` directory, plus ``lvgl/lvgl.h``, and ``lvgl/lv_version.h``.
it_it: Contiene diverse directory, ma per usare LVGL sono necessari solo i file ``.c`` e ``.h`` nella directory ``src``, più ``lvgl/lvgl.h``, e ``lvgl/lv_version.h``.

source: It continues propagating up the Widget's parent hierarchy up to the :ref:`Screen <screens>`.
it_it: Continua a propagarsi lungo la gerarchia del genitore del Widget fino a :ref:`Screen <screens>`.

source: It creates the necessary directory for the header files in the destination installation directory.
it_it: Crea la directory necessaria per i file header nella directory di installazione di destinazione.

source: It deletes the widget and all of its children.
it_it: Elimina il widget e tutti i suoi elementi figlio.

source: It describes all the peripheral configurations and pin mappings.
it_it: Descrive tutte le configurazioni delle periferiche e le mappature dei pin.

source: It describes how the glyph data is stored.
it_it: Descrive come vengono memorizzati i dati del glifo.

source: It divides the sysroot into individual components, which can be thought of as the building blocks or packages that make up the entire sysroot environment.
it_it: Suddivide la sysroot in singoli componenti, che possono essere considerati come blocchi costitutivi o pacchetti che costituiscono l'intero ambiente sysroot.

source: It does not define specific events beyond those common to all widgets.
it_it: Non definisce eventi specifici, oltre a quelli comuni a tutti i widget.

source: It does not have to be a direct child.
it_it: Non deve essere necessariamente un elemento figlio diretto.

source: It does not use the STM32 HAL.
it_it: Non utilizza l'HAL STM32.

source: It does this by being a union of all the different types that might be needed.
it_it: Lo fa essendo un'unione di tutti i diversi tipi che potrebbero essere necessari.

source: It does this by saving some additional information about the current vertical position of the text shown.
it_it: Questo risultato viene ottenuto salvando alcune informazioni aggiuntive sulla posizione verticale corrente del testo visualizzato.

source: It does this through an "evaluation callback" function pointer (a.k.a.
it_it: Ciò avviene tramite un puntatore a funzione di "callback di valutazione" (nota anche come

source: It doesn't look sharp on displays with a low resolution.
it_it: Non risulta nitido sui display a bassa risoluzione.

source: It doesn't matter how the children are positioned, as only the current x and y coordinates are considered.
it_it: Non importa come siano posizionati i figli, poiché vengono considerate solo le coordinate x e y correnti.

source: It drives the same EVE chips but is a simpler, more standalone implementation which uses software rendering and sends all the pixels over SPI so it is much slower.
it_it: Controlla gli stessi chip EVE, ma è un'implementazione più semplice e autonoma che utilizza il rendering software e invia tutti i pixel tramite SPI, quindi è molto più lenta.

source: It enables running LVGL without a windowing system such as X11 or Wayland, making it suitable for embedded devices, single-board computers, and direct-to-display applications.
it_it: Consente di eseguire LVGL senza un sistema a finestre come X11 o Wayland, rendendolo adatto a dispositivi embedded, computer a scheda singola e applicazioni direct-to-display.

source: It enables the use of light-weight monochrome "characters" instead of real images.
it_it: Permette l'uso di "caratteri" monocromatici leggeri al posto di immagini reali.

source: It ensures that only the appropriate files are included.
it_it: Questo garantisce che vengano inclusi solo i file appropriati.
